# Pandas

In [19]:
import numpy as np
import pandas as pd

In [20]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

#### 0. Создать датафрейм.

In [21]:
df = pd.DataFrame(data, labels)

#### 1. Вывести информацию о датафрейме.

In [113]:
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [114]:
df.describe()

            age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

In [115]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
animal      10 non-null object
age         8 non-null float64
visits      10 non-null int64
priority    10 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

#### 2. Вернуть первые 3 строки DataFrame `df`.

In [6]:
df.iloc[:3]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [7]:
df.head(3)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

#### 3. Выберите только столбцы 'animal' и 'age' из DataFrame `df`.

In [10]:
df.loc[:, ['animal','age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

In [13]:
df[['animal', 'age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

#### 4. Выберите данные в строках `[3, 4, 8]` * и * в столбцах `['animal', 'age']`.

In [118]:
df.iloc[[3,4,8],[0,1]]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

In [119]:
df.loc[['d','e','i'],['animal','age']]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

#### 5. Выберите строки где количество посещений больше 3.

In [120]:
df[df.visits>3]

Empty DataFrame
Columns: [animal, age, visits, priority]
Index: []

#### 6. Выберите строки, в которых отсутствует возраст.

In [12]:
df[~(df.age>=0)]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

In [37]:
df[df.age!=df.age]

  animal  age  visits priority
d    dog  NaN     3.0      yes
h    cat  NaN     1.0      yes

In [39]:
df[df['age'].isnull()]

  animal  age  visits priority
d    dog  NaN     3.0      yes
h    cat  NaN     1.0      yes

#### 7. Выберите строки, в которых животное является кошкой * и * возраст составляет менее 3 лет.

In [123]:
df[(df.animal=='cat') & (df.age < 3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

#### 8. Выберите строки в которых возраст от 2 до 4 (включительно).

In [124]:
df[(df.age>=2) & (df.age<=4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

#### 9. Измените возраст в строке 'f' на 1,5.

In [22]:
df.loc['f','age'] = 1.5
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

#### 10. Рассчитать общее количество всех посещений.

In [23]:
sum(df.visits)

19

#### 11. Расчитайте суммарный возраст животных

In [24]:
df.groupby('animal').sum()['age']

animal
cat       7.0
dog      15.0
snake     5.0
Name: age, dtype: float64

#### 12. Добавьте новую строку `k` к `df` со значениями по вашему желанию. Затем удалите ее.

In [25]:
df.loc['k'] = ['cat', 3.0, 1.0, 'no']
print(df, '\n')
df.drop('k', inplace=True)
print(df)

  animal  age  visits priority
a    cat  2.5     1.0      yes
b    cat  3.0     3.0      yes
c  snake  0.5     2.0       no
d    dog  NaN     3.0      yes
e    dog  5.0     2.0       no
f    cat  1.5     3.0       no
g  snake  4.5     1.0       no
h    cat  NaN     1.0      yes
i    dog  7.0     2.0       no
j    dog  3.0     1.0       no
k    cat  3.0     1.0       no

  animal  age  visits priority
a    cat  2.5     1.0      yes
b    cat  3.0     3.0      yes
c  snake  0.5     2.0       no
d    dog  NaN     3.0      yes
e    dog  5.0     2.0       no
f    cat  1.5     3.0       no
g  snake  4.5     1.0       no
h    cat  NaN     1.0      yes
i    dog  7.0     2.0       no
j    dog  3.0     1.0       no

#### 13. Подсчитайте количество животных каждого типа в `df`.

In [26]:
df.groupby('animal').animal.count()

animal
cat      4
dog      4
snake    2
Name: animal, dtype: int64

In [17]:
df.animal.value_counts()

cat      4
dog      4
snake    2
Name: animal, dtype: int64

#### 14. Сортируйте `df` сначала по значениям в 'age' в * возрастающем * порядке, затем по значениям в столбце 'visit' в * возрастающем * порядке.

In [27]:
df.sort_values(by=['age', 'visits'])

  animal  age  visits priority
c  snake  0.5     2.0       no
f    cat  1.5     3.0       no
a    cat  2.5     1.0      yes
j    dog  3.0     1.0       no
b    cat  3.0     3.0      yes
g  snake  4.5     1.0       no
e    dog  5.0     2.0       no
i    dog  7.0     2.0       no
h    cat  NaN     1.0      yes
d    dog  NaN     3.0      yes

#### 15. В столбце приоритет замените значения на `Yes` и `No`

In [28]:
df.loc[df.priority=='yes', 'priority'] = 'Yes'
df.loc[df.priority=='no', 'priority'] = 'No'
df

  animal  age  visits priority
a    cat  2.5     1.0      Yes
b    cat  3.0     3.0      Yes
c  snake  0.5     2.0       No
d    dog  NaN     3.0      Yes
e    dog  5.0     2.0       No
f    cat  1.5     3.0       No
g  snake  4.5     1.0       No
h    cat  NaN     1.0      Yes
i    dog  7.0     2.0       No
j    dog  3.0     1.0       No

In [31]:
df.replace('yes','Yes')
df.replace('no','No')

   animal  age  visits priority
a     cat  2.5     1.0      Yes
b     cat  3.0     3.0      Yes
c  python  0.5     2.0       No
d     dog  NaN     3.0      Yes
e     dog  5.0     2.0       No
f     cat  1.5     3.0       No
g  python  4.5     1.0       No
h     cat  NaN     1.0      Yes
i     dog  7.0     2.0       No
j     dog  3.0     1.0       No

#### 16. В столбце «animal» измените записи «snake» на «python».

In [29]:
df.loc[df.animal=='snake', 'animal'] = 'python'
df

   animal  age  visits priority
a     cat  2.5     1.0      Yes
b     cat  3.0     3.0      Yes
c  python  0.5     2.0       No
d     dog  NaN     3.0      Yes
e     dog  5.0     2.0       No
f     cat  1.5     3.0       No
g  python  4.5     1.0       No
h     cat  NaN     1.0      Yes
i     dog  7.0     2.0       No
j     dog  3.0     1.0       No

In [30]:
df.replace('snake','python')

   animal  age  visits priority
a     cat  2.5     1.0      Yes
b     cat  3.0     3.0      Yes
c  python  0.5     2.0       No
d     dog  NaN     3.0      Yes
e     dog  5.0     2.0       No
f     cat  1.5     3.0       No
g  python  4.5     1.0       No
h     cat  NaN     1.0      Yes
i     dog  7.0     2.0       No
j     dog  3.0     1.0       No

#### 17. Удалите все повторения строк из таблицы
```python
df = pd.DataFrame ({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
```

In [32]:
df = pd.DataFrame ({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df.drop_duplicates(subset=['A'])

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

#### 20. Предположим, у вас есть DataFrame с 10 столбцами действительных чисел, например:

```python
df = pd.DataFrame (np.random.random (size = (5, 10)), columns = список ('abcdefghij'))
```
#### Какой столбец имеет наименьшую сумму? Найдите метку этого столбца.

In [166]:
df = pd.DataFrame(np.random.random(size = (5, 10)), columns = list('abcdefghij'))
print(df.sum())
index = np.argmin(df.sum())
print(index)

a    2.769699
b    2.655055
c    2.305544
d    2.073146
e    2.701097
f    1.370938
g    1.860942
h    2.923258
i    2.837918
j    2.440242
dtype: float64
f

#### 21. Замените все пропущенные значения, на среднее по столбцу
```python
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})
```

In [170]:
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})
print(df)
sred = np.mean(df.value)
df.loc[df.value!=df.value, 'value'] = sred
print(df)

   group  value
0      a    1.0
1      a    2.0
2      b    3.0
3      b    NaN
4      a    2.0
5      b    3.0
6      b    NaN
7      b    1.0
8      a    7.0
9      b    3.0
10     a    NaN
11     b    8.0
   group     value
0      a  1.000000
1      a  2.000000
2      b  3.000000
3      b  3.333333
4      a  2.000000
5      b  3.000000
6      b  3.333333
7      b  1.000000
8      a  7.000000
9      b  3.000000
10     a  3.333333
11     b  8.000000

#### 22. Создайте два новых столбца, для From и To. Приведите названия городов к нормальному виду.

```python
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
```

In [172]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [208]:
from_to = df.From_To.values
from_to = np.array([x.split('_') for x in from_to])
df_from = from_to[:,0]
df_to = from_to[:,1]
series_from = pd.Series([x.lower().title() for x in df_from])
series_to = pd.Series([x.lower().title() for x in df_to])
df['From'] = series_from
df['To'] = series_to
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),London,Paris
1,MAdrid_miLAN,NaN,[],<Air France> (12),Madrid,Milan
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,Budapest_PaRis,NaN,[13],12. Air France,Budapest,Paris
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",Brussels,London